<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>	</title>
</head>
<body>
	<?php 
$a = 10; //-операція присвоєння
 $b = 20;
   $c = $a.$b;//- (конкентенація рядків) результатом цієї операції буде присвоєння змінній с - числа буде 1020 - тому що ця операція повертає нам строку
   echo $c."<br/>";
   // - комбінування операцій присвоєння
   $a+=5;//- результатом данної операції буде присвоєння змінній а - числ 15, так як данний вираз еквівалентний натспуному: $a = $a + 5;
   echo $a."<br/>";
   // - інкременти, декрименти
    ++$a;
    echo $a."<br/>";//- данна операція присвоїть змінній а значення 16(на одиничку більше від попереднгього)
    //- операція рівності;
    $a == $b;// - данна операція поверне нам false, так як a недорівнює b
    $a === $c;//- операція ідентичності - повертає нам true , якшо дві змінні мають один тип(строка, число,булеан)

    //- логічні операції
    $and = $a<20 && $b>15;
    echo $and." <br/>";//-Логічне і поверта нам 1(або true) якщо обидва вирази повернуть нам true
    $or = $a< 20 || $b<15;
    echo $or." <br/>";//-Логічне або поверне нам true , якщо хоча б один вираз буде правильним;
    // -тернарна операція
    $z = $a>$b ? "true" : "false";
      echo $z;// Тернарна операція повертає одне з двох значення які ви задали, якщо вона повертає перше значення - то умова true, друге значення - false;
	 ?>
</body>  
</html>